9/data/attachments/718f942dcff4917c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6e2c9cea-0d10-4338-8b40-66eaf03f2c02</nif:username>
            <nif:friendToBeAdded>Joshua_care_Friend_79367_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>